# St7SetTHAInitialAttributeOverride

Assigns the state of the override flag to be used with the transient heat analysis initial conditions file.

long St7SetTHAInitialAttributeOverride(long uID, bool Active)
Input Parameters
uID
Strand7 model file ID.
Active
True for the initial result file temperatures to override nodal temperature attributes.